In [ ]:
import mysql.connector
from mysql.connector import Error
from sqlalchemy import create_engine
import pandas as pd

ModuleNotFoundError: No module named 'sqlalchemy'

In [4]:
import sqlalchemy
sqlalchemy.__version__

'1.4.22'

In [2]:
# Function to extract table to a pandas DataFrame
def extract_table_to_pandas(tablename, db_engine):
    query = "SELECT * FROM {}".format(tablename)
    return pd.read_sql(query, db_engine)

db_engine = create_engine('mysql+mysqlconnector://{0}:{1}@{2}/{3}'.
                                                   format('root', '12345', 
                                                          'localhost', 'elearning'))

In [3]:
def print_user_comparison(user1, user2, user3):
    print("Course id overlap between users:")
    print("================================")
    print("User 1 and User 2 overlap: {}".format(
    set(user1.course_id) & set(user2.course_id)
    ))
    print("User 1 and User 3 overlap: {}".format(
    set(user1.course_id) & set(user3.course_id)
    ))
    print("User 2 and User 3 overlap: {}".format(
    set(user2.course_id) & set(user3.course_id)
    ))

In [4]:
# Get user with id 4387
user1 = pd.read_sql("SELECT * FROM rating where user_id=4387", db_engine)

# Get user with id 18163
user2 = pd.read_sql("SELECT * FROM rating where user_id=18163", db_engine)

# Get user with id 8770
user3 = pd.read_sql("SELECT * FROM rating where user_id=8770", db_engine)

# Use the helper function to compare the 3 users
print_user_comparison(user1, user2, user3)

Course id overlap between users:
================================
User 1 and User 2 overlap: {32, 96, 36, 6, 7, 44, 95}
User 1 and User 3 overlap: set()
User 2 and User 3 overlap: set()

In [5]:
def extract_rating_data(db_engine):
    return pd.read_sql("SELECT * FROM rating", db_engine)

def extract_course_data(db_engine):
    return pd.read_sql("SELECT * FROM courses", db_engine)

In [6]:
ratings = extract_rating_data(db_engine)

course_data = extract_course_data(db_engine)

In [7]:
ratings.head()

   user_id  course_id  rating
0        1          6       4
1        1         36       5
2        1         37       5
3        1         45       5
4        1         50       5

In [8]:
course_data.head()

,course_id,title,description,programming_language
0,1,Machine Learning with Apache Spark,"Spark is a powerful, general purpose tool for ...",python
1,2,Financial Analytics in Spreadsheets,Monitoring the evolution of traded assets is k...,spreadsheets
2,3,Intermediate R,The intermediate R course is the logical next ...,r
3,4,Data Visualization with ggplot2 (Part 2),This ggplot2 tutorial builds on your knowledge...,r
4,5,Fraud Detection in R,The Association of Certified Fraud Examiners e...,r

In [9]:
ratings.user_id.nunique()

38174

In [10]:
course_data.shape

(100, 4)

In [11]:
# Print out the number of missing values per column
print(course_data.isnull().sum())

course_id               0
title                   0
description             0
programming_language    3
dtype: int64

In [12]:
# The transformation should fill in the missing values
def transform_fill_programming_language(course_data):
    imputed = course_data.fillna({"programming_language": "R"})
    return imputed

transformed = transform_fill_programming_language(course_data)

# Print out the number of missing values per column of transformed
print(transformed.isnull().sum())

course_id               0
title                   0
description             0
programming_language    0
dtype: int64

In [13]:
# transformation function
def transform_avg_rating(rating_data):
    # Group by course_id and extract average rating per course
    avg_rating = rating_data.groupby('course_id').rating.mean()
    # Return sorted average ratings per course
    sort_rating = avg_rating.sort_values(ascending=False).reset_index()
    return sort_rating

In [14]:
# Use transform_avg_rating on the extracted data and print results
avg_course_ratings = transform_avg_rating(ratings)
print(avg_course_ratings)

    course_id    rating
0          46  4.800000
1          23  4.800000
2          96  4.692765
3          56  4.661765
4          24  4.653061
..        ...       ...
94         54  4.238095
95         92  4.222222
96         29  4.208333
97         17  4.147059
98         42  4.107570

[99 rows x 2 columns]

In [36]:
# def get_courses_to_recommend(ratings, course_data):
#     user_list = ratings.user_id.unique()

#     course_set = set(course_data.course_id.unique())

#     non_enrolled_users = []

#     for user in user_list:
#         rated_course_set = set(ratings[ratings.user_id == user].course_id.unique())
#         non_enrolled_courses = course_set - rated_course_set
#         non_enrolled_users = non_enrolled_users + [(user, cid) for cid in non_enrolled_courses]
#         break
#     non_enrolled_courses_df = pd.DataFrame(non_enrolled_users, columns = ['user_id', 'course_id'])
#     return non_enrolled_courses_df

# courses_to_recommend = get_courses_to_recommend(ratings, course_data)
# courses_to_recommend.to_csv('courses_to_recommend.csv', index = False)
# courses_to_recommend.sample(n=500).to_csv('courses_to_recommend_small.csv', index = False)

    user_id  course_id
0         1          1
1         1          2
2         1          3
3         1          4
4         1          5
..      ...        ...
89        1         96
90        1         97
91        1         98
92        1         99
93        1        100

[94 rows x 2 columns]

In [13]:
course_data.shape

(100, 4)

In [15]:
temp = pd.read_csv('courses_to_recommend.csv')
temp.sample(n=2000).to_csv('courses_to_recommend_small.csv', index = False)

In [16]:
temp.shape

(3758228, 2)

In [17]:
courses_to_recommend = pd.read_csv('courses_to_recommend_small.csv')

courses_to_recommend.head()

   user_id  course_id
0    33673         43
1    31548         64
2    26951         25
3     6008         17
4     3494         30

In [44]:
courses_to_recommend.groupby('user_id').count()

         course_id
user_id
7                1
44               1
49               1
65               1
83               1
...            ...
38068            1
38074            1
38090            1
38141            1
38152            1

[1950 rows x 1 columns]

In [18]:
# Complete the transformation function
def transform_recommendations(avg_course_ratings, courses_to_recommend):
    # Merge both DataFrames
    merged = courses_to_recommend.merge(avg_course_ratings) 
    
    # Sort values by rating and group by user_id
    grouped = merged.sort_values("rating", ascending=False).groupby("user_id")
    
    # Produce the top 3 values and sort by user_id
    recommendations = grouped.head(5).sort_values("user_id").reset_index()
    
    final_recommendations = recommendations[["user_id", "course_id","rating"]]
    
    # Return final recommendations
    return final_recommendations


# Use the function with the predefined DataFrame objects
recommendations = transform_recommendations(avg_course_ratings, courses_to_recommend)

In [19]:
recommendations.head()

   user_id  course_id    rating
0       14         49  4.492537
1       22         44  4.593866
2       38         22  4.462185
3       72         32  4.575688
4       78         94  4.529412

In [46]:
# Merge both DataFrames
merged = courses_to_recommend.merge(avg_course_ratings) 

merged.head()

   user_id  course_id    rating
0    28900         90  4.492191
1    28933         90  4.492191
2    17770         90  4.492191
3    21548         90  4.492191
4    13173         90  4.492191

In [47]:
merged.sort_values("rating", ascending=False).head()

      user_id  course_id  rating
1746     9481         46     4.8
32      35386         23     4.8
24       1892         23     4.8
25      30284         23     4.8
26      33843         23     4.8

In [48]:
merged[merged.user_id == 30251]

     user_id  course_id    rating
976    30251         72  4.340278

In [49]:
# Sort values by rating and group by user_id
grouped = merged.sort_values("rating", ascending=False).groupby("user_id")


# Produce the top 3 values and sort by user_id
recommendations = grouped.head(3).sort_values("user_id")

recommendations.head()

      user_id  course_id    rating
1828        7         28  4.578947
153        44         57  4.411765
1053       49         49  4.492537
1027       65          2  4.253012
854        83         24  4.653061

In [50]:
recommendations[recommendations.user_id == 16456]

Empty DataFrame
Columns: [user_id, course_id, rating]
Index: []

In [51]:
recommendations = transform_recommendations(avg_course_ratings, courses_to_recommend)

In [20]:
db_engine = create_engine('mysql+mysqlconnector://{0}:{1}@{2}/{3}'.
                                                   format('root', '12345', 
                                                          'localhost', 'elearning'))

def load_to_dwh(recommendations, db_engine):
    recommendations.to_sql("recommendations", db_engine, if_exists="replace")

In [21]:
load_to_dwh(recommendations, db_engine)

In [55]:
def recommendations_for_user(user_id, threshold=4.5):
    # Join with the courses table
    query = """
    SELECT title, rating FROM recommendations
    INNER JOIN courses ON courses.course_id = recommendations.course_id
    WHERE user_id=%(user_id)s AND rating>%(threshold)s
    ORDER BY rating DESC
    """
    # Add the threshold parameter
    predictions_df = pd.read_sql(query, db_engine, params = {"user_id": user_id, 
                                                           "threshold": threshold})
    return predictions_df.title.values

# Try the function you created
print(recommendations_for_user(44, 4.0))

['Statistical Modeling in R (Part 2)']

## ETL: Combine all the operations

In [54]:
def etl(db_engine):
    # Extract the data
    courses = extract_course_data(db_engine)
    rating = extract_rating_data(db_engine)
    
    # Clean up courses data
    courses = transform_fill_programming_language(courses)
    
    # Get the average course ratings
    avg_course_rating = transform_avg_rating(rating)
    
    # Get eligible user and course id pairs
    courses_to_recommend = pd.read_csv('courses_to_recommend_small.csv')
    
    # Calculate the recommendations
    recommendations = transform_recommendations(
    avg_course_rating,
    courses_to_recommend,
    )
    
    # Load the recommendations into the database
    load_to_dwh(recommendations, db_engine)

In [55]:
etl(db_engine)

## Assignment

1. Recommend courses based on programming_language.
   - Build a logic and create flolwchart of it.
   - Write the code for it in python/sql.